mdhardenburgh/Blinky/Packages/.cache/NXP.MK65F18_DFP.12.0.0.pdsc
    <condition id="device.MK65F18_AND_driver.edma_AND_driver.uart">
      <accept Dname="MK65FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK65FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK65F18_AND_utility.debug_console">
      <accept Dname="MK65FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK65FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MK65F18_AND_component.serial_manager_AND_driver.common">
      <accept Dname="MK65FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK65FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK65F18_AND_component.lists_AND_driver.common_AND_utility.debug_console">
      <accept Dname="MK65FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK65FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MK65F18" Cversion="1.0.0" condition="device.MK65F18_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MK65F18_startup_AND_driver.adc16_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.i2c_AND_driver.port_AND_driver.rtc_AND_driver.smc_AND_driver.uart_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.MK65F18_AND_driver.dmamux_AND_driver.edma">
      <description/>
      <files>
        <file category="header" attr="config" name="template/RTE_Device.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c" Cversion="2.1.0" condition="device.MK65F18_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/codec/i2c/fsl_codec_i2c.c"/>
        <file category="header" name="components/codec/i2c/fsl_codec_i2c.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter" Cversion="1.0.0" condition="device.MK65F18_AND_driver.common_AND_driver.i2c">
      <description/>
      <files>
        <file category="header" name="components/i2c/i2c.h"/>
        <file category="sourceC" name="components/i2c/i2c_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="device.MK65F18_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/lists/generic_list.c"/>
        <file category="header" name="components/lists/generic_list.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr_adapter" Cversion="1.0.0" condition="device.MK65F18_AND_driver.common_AND_driver.lptmr">
      <description/>
      <files>
        <file category="sourceC" name="components/timer/lptmr_adapter.c"/>
        <file category="header" name="components/timer/timer.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.0" condition="device.MK65F18_AND_component.lists_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_manager.c"/>
        <file category="header" name="components/serial_manager/serial_manager.h"/>
        <file category="header" name="components/serial_manager/serial_port_internal.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="device.MK65F18_AND_driver.lpuart_OR_driver.uart">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_port_uart.c"/>
        <file category="header" name="components/serial_manager/serial_port_uart.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter" Cversion="2.1.0" condition="device.MK65F18_AND_driver.codec_AND_driver.sgtl5000">
      <description/>
      <files>
        <file category="sourceC" name="components/codec/port/sgtl5000/fsl_codec_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter" Cversion="1.0.0" condition="device.MK65F18_AND_driver.common_AND_driver.uart">
      <description/>
      <files>
        <file category="header" name="components/uart/uart.h"/>
        <file category="sourceC" name="components/uart/uart_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MK65F18_startup" Cversion="1.0.0" condition="device.MK65F18_AND_CMSIS_Include_core_cm4">
      <description/>
      <files>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MK65F18.s"/>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MK65F18.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MK65FN2M0xxx18_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MK65FN2M0xxx18_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MK65FX1M0xxx18_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MK65FX1M0xxx18_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MK65FN2M0xxx18_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MK65FN2M0xxx18_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MK65FX1M0xxx18_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MK65FX1M0xxx18_ram.icf"/>
        <file category="header" attr="config" name="MK65F18.h"/>
        <file category="header" attr="config" name="MK65F18_features.h"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="sourceC" attr="config" name="system_MK65F18.c"/>
        <file category="header" attr="config" name="system_MK65F18.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.0.2" condition="device.MK65F18_AND_driver.common">
      <description>ADC16 Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc16.c"/>
        <file category="header" name="drivers/fsl_adc16.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache" Cversion="2.0.1" condition="device.MK65F18_AND_driver.common">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cache.c"/>
        <file category="header" name="drivers/fsl_cache.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.MK65F18_AND_driver.common">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
        <file category="header" name="drivers/fsl_clock.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp" Cversion="2.0.1" condition="device.MK65F18_AND_driver.common">
      <description>CMP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cmp.c"/>
        <file category="header" name="drivers/fsl_cmp.h"/>
      </files>
    </component>
